dsl/poas/structurizr-mlpaOnlineContainerContainers.puml
@startuml
set separator none
title Make a Lasting Power of Attorney Online - Containers

top to bottom direction

skinparam {
  shadowing false
  arrowFontSize 10
  defaultTextAlignment center
  wrapWidth 200
  maxMessageSize 100
}

hide stereotype

skinparam rectangle<<MakeaLastingPowerofAttorneyOnline.App>> {
  BackgroundColor #438dd5
  FontColor #ffffff
  BorderColor #2e6295
}
skinparam person<<Attorney>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam person<<CertificateProvider>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam database<<MakeaLastingPowerofAttorneyOnline.Database>> {
  BackgroundColor #438dd5
  FontColor #ffffff
  BorderColor #2e6295
}
skinparam person<<Donor>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam database<<MakeaLastingPowerofAttorneyOnline.MonitoringandTelemetery>> {
  BackgroundColor #438dd5
  FontColor #ffffff
  BorderColor #2e6295
}

person "==Attorney\n<size:10>[Person]</size>\n\nAttorney interacting with a Lasting Power of Attorney." <<Attorney>> as Attorney
person "==Donor\n<size:10>[Person]</size>\n\nDonor drafting the Lasting Power of Attorney." <<Donor>> as Donor
person "==Certificate Provider\n<size:10>[Person]</size>\n\nCertificate Provider interacting with a Lasting Power of Attorney." <<CertificateProvider>> as CertificateProvider

rectangle "Make a Lasting Power of Attorney Online\n<size:10>[Software System]</size>" <<MakeaLastingPowerofAttorneyOnline>> {
  skinparam RectangleBorderColor<<MakeaLastingPowerofAttorneyOnline>> #0b4884
  skinparam RectangleFontColor<<MakeaLastingPowerofAttorneyOnline>> #0b4884

  rectangle "==App\n<size:10>[Container: Go, HTML, CSS, JS]</size>\n\nProvides and delivers static content, business logic, routing, third party access and database access" <<MakeaLastingPowerofAttorneyOnline.App>> as MakeaLastingPowerofAttorneyOnline.App
  database "==Database\n<size:10>[Container: DynamoDB]</size>\n\nStores actor information, Draft LPA details, access logs, etc." <<MakeaLastingPowerofAttorneyOnline.Database>> as MakeaLastingPowerofAttorneyOnline.Database
  database "==Monitoring and Telemetery\n<size:10>[Container: AWS Cloudwatch]</size>\n\nCloudwatch logs, X-Ray and RUM" <<MakeaLastingPowerofAttorneyOnline.MonitoringandTelemetery>> as MakeaLastingPowerofAttorneyOnline.MonitoringandTelemetery
}

MakeaLastingPowerofAttorneyOnline.App .[#707070,thickness=2].> Donor : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline.App .[#707070,thickness=2].> Attorney : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline.App .[#707070,thickness=2].> CertificateProvider : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline.App .[#707070,thickness=2].> MakeaLastingPowerofAttorneyOnline.Database : "<color:#707070>reads and writes data to"
MakeaLastingPowerofAttorneyOnline.Database .[#707070,thickness=2].> MakeaLastingPowerofAttorneyOnline.MonitoringandTelemetery : "<color:#707070>interacts with"
@enduml
